Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# SaveSelection_Overwrite
source: Replace
ar: استبدال
cs: Nahradit
de: Ersetzen
el: Αντικατάσταση
es: Reemplazar
fa: جایگزینی
fr: Remplacer
hu: Csere
id: Ganti
it: Sostituisci
ja: 置き換える
ko: 바꾸기
pl: Zastąp
pt: Substituir
ro: Înlocuire
th: แทนที่
tr: Değiştir
uk: Замінити
vi: Thay thế
zh_hans: 替换
zh_hant: 取代

# LoadSelection_Title
source: Load Saved Selection
ar: تحميل تحديد محفوظ
cs: Načíst uložený výběr
de: Gespeicherte Auswahl laden
el: Φόρτωση αποθηκευμένης επιλογής
es: Cargar selección guardada
fa: بارگذاری انتخاب ذخیره‌شده
fr: Charger une sélection enregistrée
hu: Mentett kijelölés betöltése
id: Muat Pilihan Tersimpan
it: Carica selezione salvata
ja: 保存した選択範囲を読み込む
ko: 저장된 선택 영역 로드
pl: Wczytaj zapisane zaznaczenie
pt: Carregar seleção salva
ro: Încărcare selecție salvată
th: โหลดส่วนที่เลือกที่บันทึกไว้
tr: Kaydedilmiş Seçimi Yükle
uk: Завантаження збереженого виділення
vi: Tải Vùng chọn Đã lưu
zh_hans: 加载已保存的选定内容
zh_hant: 載入已儲存的選取範圍

# LoadSelection_ListName
source: Saved selections
ar: التحديدات المحفوظة
cs: Uložené výběry
de: Gespeicherte Auswahlen
el: Αποθηκευμένες επιλογές
es: Selecciones guardadas
fa: انتخاب‌های ذخیره‌شده
fr: Sélections enregistrées
hu: Mentett kijelölések
id: Pilihan tersimpan
it: Selezioni salvate
ja: 保存した選択範囲
ko: 저장된 선택 영역
pl: Zapisane zaznaczenia
pt: Seleções salvas
ro: Selecții salvate
th: ส่วนที่เลือกที่บันทึกไว้
tr: Kaydedilmiş seçimler
uk: Збережені виділення
vi: Vùng chọn đã lưu
zh_hans: 已保存的选定内容
zh_hant: 已儲存的選取範圍

# LoadSelection_Item
source: {0} — {1} ranges, {2} bytes, {3}
ar: {0} — {1} نطاقات، {2} بايت، {3}
cs: {0} — rozsahy: {1}, bajty: {2}, {3}
de: {0} — {1} Bereiche, {2} Bytes, {3}
el: {0} — {1} περιοχές, {2} byte, {3}
es: {0} — {1} rangos, {2} bytes, {3}
fa: {0} — {1} محدوده، {2} بایت، {3}
fr: {0} — {1} plages, {2} octets, {3}
hu: {0} — {1} tartomány, {2} bájt, {3}
id: {0} — {1} rentang, {2} byte, {3}
it: {0} — {1} intervalli, {2} byte, {3}
ja: {0} — {1} 個の範囲、{2} バイト、{3}
ko: {0} — {1}개 범위, {2}바이트, {3}
pl: {0} — zakresy: {1}, bajty: {2}, {3}
pt: {0} — {1} intervalos, {2} bytes, {3}
ro: {0} — {1} intervale, {2} octeți, {3}
th: {0} — {1} ช่วง, {2} ไบต์, {3}
tr: {0} — {1} aralık, {2} bayt, {3}
uk: {0} — діапазонів: {1}, байтів: {2}, {3}
vi: {0} — {1} phạm vi, {2} byte, {3}
zh_hans: {0} — {1} 个范围，{2} 字节，{3}
zh_hant: {0} — {1} 個範圍，{2} 個位元組，{3}

# LoadSelection_Replace
source: Replace the selection
ar: استبدال التحديد
cs: Nahradit výběr
de: Auswahl ersetzen
el: Αντικατάσταση της επιλογής
es: Reemplazar la selección
fa: جایگزینی انتخاب
fr: Remplacer la sélection
hu: Kijelölés lecserélése
id: Ganti pilihan
it: Sostituisci la selezione
ja: 置き換える
ko: 선택 영역 바꾸기
pl: Zastąp zaznaczenie
pt: Substituir a seleção
ro: Înlocuire selecție
th: แทนที่ส่วนที่เลือก
tr: Seçimi değiştir
uk: Замінити виділення
vi: Thay thế vùng chọn
zh_hans: 替换选定内容
zh_hant: 取代選取範圍

# LoadSelection_Add
source: Add to the current selection
ar: إضافة إلى التحديد الحالي
cs: Přidat k aktuálnímu výběru
de: Zur aktuellen Auswahl hinzufügen
el: Προσθήκη στην τρέχουσα επιλογή
es: Agregar a la selección actual
fa: افزودن به انتخاب فعلی
fr: Ajouter à la sélection actuelle
hu: Hozzáadás az aktuális kijelöléshez
id: Tambahkan ke pilihan saat ini
it: Aggiungi alla selezione corrente
ja: 現在の選択に追加
ko: 현재 선택에 추가
pl: Dodaj do bieżącego zaznaczenia
pt: Adicionar à seleção atual
ro: Adăugare la selecția curentă
th: เพิ่มลงในส่วนที่เลือกปัจจุบัน
tr: Geçerli seçime ekle
uk: Додати до поточного виділення
vi: Thêm vào vùng chọn hiện tại
zh_hans: 添加到当前选定内容
zh_hant: 新增到目前的選取範圍

# LoadSelection_Delete
source: Delete
ar: حذف
cs: Odstranit
de: Löschen
el: Διαγραφή
es: Eliminar
fa: حذف
fr: Supprimer
hu: Törlés
id: Hapus
it: Elimina
ja: 削除
ko: 삭제
pl: Usuń
pt: Excluir
ro: Ștergere
th: ลบ
tr: Sil
uk: Видалити
vi: Xóa
zh_hans: 删除
zh_hant: 刪除

# LoadSelection_Rename
source: Rename
ar: إعادة تسمية
cs: Přejmenovat
de: Umbenennen
el: Μετονομασία
es: Cambiar nombre
fa: تغییر نام
fr: Renommer
hu: Átnevezés
id: Ganti nama
it: Rinomina
ja: 名前を変更
ko: 이름 바꾸기
pl: Zmień nazwę
pt: Renomear
ro: Redenumire
th: เปลี่ยนชื่อ
tr: Yeniden adlandır
uk: Перейменувати
vi: Đổi tên
zh_hans: 重命名
zh_hant: 重新命名

# LoadSelection_NewName
source: New name
ar: الاسم الجديد
cs: Nový název
de: Neuer Name
el: Νέο όνομα
es: Nombre nuevo
fa: نام جدید
fr: Nouveau nom
hu: Új név
id: Nama baru
it: Nuovo nome
ja: 新しい名前
ko: 새 이름
pl: Nowa nazwa
pt: Novo nome
ro: Nume nou
th: ชื่อใหม่
tr: Yeni ad
uk: Нове ім’я
vi: Tên mới
zh_hans: 新名称
zh_hant: 新名稱

# LoadSelection_Note
source: Saved selections keep their offsets. Unlike bookmarks, they don't move when you insert or delete data.
ar: تحتفظ التحديدات المحفوظة بإزاحاتها. على عكس الإشارات المرجعية، لا تتحرك عند إدراج البيانات أو حذفها.
cs: Uložené výběry si zachovávají své posuny. Na rozdíl od záložek se při vkládání nebo odstraňování dat neposouvají.
de: Gespeicherte Auswahlen behalten ihre Offsets. Anders als Lesezeichen verschieben sie sich nicht, wenn Sie Daten einfügen oder löschen.
el: Οι αποθηκευμένες επιλογές διατηρούν τις μετατοπίσεις τους. Σε αντίθεση με τους σελιδοδείκτες, δεν μετακινούνται όταν εισάγετε ή διαγράφετε δεδομένα.
es: Las selecciones guardadas conservan sus desplazamientos. A diferencia de los marcadores, no se mueven al insertar o eliminar datos.
fa: انتخاب‌های ذخیره‌شده آفست‌های خود را حفظ می‌کنند. برخلاف نشانک‌ها، با درج یا حذف داده جابه‌جا نمی‌شوند.
fr: Les sélections enregistrées conservent leurs décalages. Contrairement aux signets, elles ne bougent pas quand vous insérez ou supprimez des données.
hu: A mentett kijelölések megtartják az eltolásaikat. A könyvjelzőkkel ellentétben nem mozdulnak el, ha adatot szúr be vagy töröl.
id: Pilihan tersimpan mempertahankan offset-nya. Tidak seperti penanda, pilihan tidak bergeser saat Anda menyisipkan atau menghapus data.
it: Le selezioni salvate mantengono i propri offset. A differenza dei segnalibri, non si spostano quando inserisci o elimini dati.
ja: 保存した選択範囲のオフセットは、データの挿入・削除でずれても調整しません (ブックマークとは異なります)。
ko: 저장된 선택 영역은 오프셋을 그대로 유지합니다. 책갈피와 달리 데이터를 삽입하거나 삭제해도 이동하지 않습니다.
pl: Zapisane zaznaczenia zachowują swoje przesunięcia. W przeciwieństwie do zakładek nie przesuwają się, gdy wstawiasz lub usuwasz dane.
pt: As seleções salvas mantêm seus deslocamentos. Diferente dos marcadores, elas não se movem quando você insere ou exclui dados.
ro: Selecțiile salvate își păstrează deplasamentele. Spre deosebire de marcaje, nu se mută când inserați sau ștergeți date.
th: ส่วนที่เลือกที่บันทึกไว้จะคงออฟเซ็ตเดิม ซึ่งต่างจากบุ๊กมาร์กตรงที่จะไม่เลื่อนเมื่อคุณแทรกหรือลบข้อมูล
tr: Kaydedilmiş seçimler ofsetlerini korur. Yer işaretlerinden farklı olarak, veri eklediğinizde veya sildiğinizde kaymazlar.
uk: Збережені виділення зберігають свої зміщення. На відміну від закладок, вони не зсуваються під час вставлення або видалення даних.
vi: Vùng chọn đã lưu giữ nguyên độ lệch. Không giống dấu trang, chúng không dịch chuyển khi bạn chèn hoặc xóa dữ liệu.
zh_hans: 已保存的选定内容保持其偏移量不变。与书签不同，插入或删除数据时它们不会移动。
zh_hant: 已儲存的選取範圍會保留其位移。與書籤不同，插入或刪除資料時不會跟著移動。

# LoadSelection_Load
source: Load
ar: تحميل
cs: Načíst
de: Laden
el: Φόρτωση
es: Cargar
fa: بارگذاری
fr: Charger
hu: Betöltés
id: Muat
it: Carica
ja: 読み込む
ko: 로드
pl: Wczytaj
pt: Carregar
ro: Încărcare
th: โหลด
tr: Yükle
uk: Завантажити
vi: Tải
zh_hans: 加载
zh_hant: 載入

# SelectionFile_Exported
source: Exported the selection to {0}.
ar: تم تصدير التحديد إلى {0}.
cs: Výběr byl exportován do {0}.
de: Die Auswahl wurde nach {0} exportiert.
el: Η επιλογή εξήχθη στο {0}.
es: Se exportó la selección a {0}.
fa: انتخاب در {0} صادر شد.
fr: Sélection exportée vers {0}.
hu: A kijelölés exportálva ide: {0}.
id: Pilihan diekspor ke {0}.
it: Selezione esportata in {0}.
ja: 選択範囲を {0} にエクスポートしました。
ko: 선택 영역을 {0}(으)로 내보냈습니다.
pl: Wyeksportowano zaznaczenie do {0}.
pt: Seleção exportada para {0}.
ro: Selecția a fost exportată în {0}.
th: ส่งออกส่วนที่เลือกไปยัง {0} แล้ว
tr: Seçim {0} konumuna aktarıldı.
uk: Виділення експортовано в {0}.
vi: Đã xuất vùng chọn ra {0}.
zh_hans: 已将选定内容导出到 {0}。
zh_hant: 已將選取範圍匯出至 {0}。

# SelectionFile_WriteError
source: Can't write the file: {0}
ar: تتعذر كتابة الملف: {0}
cs: Do souboru nelze zapisovat: {0}
de: Die Datei kann nicht geschrieben werden: {0}
el: Δεν είναι δυνατή η εγγραφή του αρχείου: {0}
es: No se puede escribir el archivo: {0}
fa: نوشتن فایل ممکن نیست: {0}
fr: Impossible d'écrire le fichier : {0}
hu: A fájl nem írható: {0}
id: Tidak dapat menulis file: {0}
it: Impossibile scrivere il file: {0}
ja: ファイルに書き込めません: {0}
ko: 파일에 쓸 수 없습니다: {0}
pl: Nie można zapisać pliku: {0}
pt: Não é possível gravar o arquivo: {0}
ro: Fișierul nu poate fi scris: {0}
th: ไม่สามารถเขียนไฟล์: {0}
tr: Dosya yazılamıyor: {0}
uk: Не вдається записати файл: {0}
vi: Không thể ghi tệp: {0}
zh_hans: 无法写入文件：{0}
zh_hant: 無法寫入檔案：{0}

# SelectionFile_ReadError
source: Can't read the file: {0}
ar: تتعذر قراءة الملف: {0}
cs: Soubor nelze přečíst: {0}
de: Die Datei kann nicht gelesen werden: {0}
el: Δεν είναι δυνατή η ανάγνωση του αρχείου: {0}
es: No se puede leer el archivo: {0}
fa: خواندن فایل ممکن نیست: {0}
fr: Impossible de lire le fichier : {0}
hu: A fájl nem olvasható: {0}
id: Tidak dapat membaca file: {0}
it: Impossibile leggere il file: {0}
ja: ファイルを読めません: {0}
ko: 파일을 읽을 수 없습니다: {0}
pl: Nie można odczytać pliku: {0}
pt: Não é possível ler o arquivo: {0}
ro: Fișierul nu poate fi citit: {0}
th: ไม่สามารถอ่านไฟล์: {0}
tr: Dosya okunamıyor: {0}
uk: Не вдається прочитати файл: {0}
vi: Không thể đọc tệp: {0}
zh_hans: 无法读取文件：{0}
zh_hant: 無法讀取檔案：{0}

# SelectionFile_ImportError
source: Line {0}: {1}
ar: السطر {0}: {1}
cs: Řádek {0}: {1}
de: Zeile {0}: {1}
el: Γραμμή {0}: {1}
es: Línea {0}: {1}
fa: خط {0}: {1}
fr: Ligne {0} : {1}
hu: {0}. sor: {1}
id: Baris {0}: {1}
it: Riga {0}: {1}
ja: {0} 行目: {1}
ko: {0}행: {1}
pl: Wiersz {0}: {1}
pt: Linha {0}: {1}
ro: Linia {0}: {1}
th: บรรทัด {0}: {1}
tr: Satır {0}: {1}
uk: Рядок {0}: {1}
vi: Dòng {0}: {1}
zh_hans: 第 {0} 行：{1}
zh_hant: 第 {0} 行：{1}

# SelectionFile_Error_StartNotNumber
source: The start isn't a number.
ar: البداية ليست رقمًا.
cs: Začátek není číslo.
de: Der Anfang ist keine Zahl.
el: Η αρχή δεν είναι αριθμός.
es: El inicio no es un número.
fa: آغاز عدد نیست.
fr: Le début n'est pas un nombre.
hu: A kezdet nem szám.
id: Awal bukan angka.
it: L'inizio non è un numero.
ja: 開始が数値ではありません
ko: 시작이 숫자가 아닙니다.
pl: Początek nie jest liczbą.
pt: O início não é um número.
ro: Începutul nu este un număr.
th: จุดเริ่มต้นไม่ใช่ตัวเลข
tr: Başlangıç bir sayı değil.
uk: Початок не є числом.
vi: Điểm đầu không phải là số.
zh_hans: 开始位置不是数字。
zh_hant: 開頭不是數字。

# SelectionFile_Error_LengthNotNumber
source: The length isn't a number.
ar: الطول ليس رقمًا.
cs: Délka není číslo.
de: Die Länge ist keine Zahl.
el: Το μήκος δεν είναι αριθμός.
es: La longitud no es un número.
fa: طول عدد نیست.
fr: La longueur n'est pas un nombre.
hu: A hossz nem szám.
id: Panjang bukan angka.
it: La lunghezza non è un numero.
ja: 長さが数値ではありません
ko: 길이가 숫자가 아닙니다.
pl: Długość nie jest liczbą.
pt: O comprimento não é um número.
ro: Lungimea nu este un număr.
th: ความยาวไม่ใช่ตัวเลข
tr: Uzunluk bir sayı değil.
uk: Довжина не є числом.
vi: Độ dài không phải là số.
zh_hans: 长度不是数字。
zh_hant: 長度不是數字。

# SelectionFile_Error_EndNotNumber
source: The end isn't a number.
ar: النهاية ليست رقمًا.
cs: Konec není číslo.
de: Das Ende ist keine Zahl.
el: Το τέλος δεν είναι αριθμός.
es: El final no es un número.
fa: پایان عدد نیست.
fr: La fin n'est pas un nombre.
hu: A vég nem szám.
id: Akhir bukan angka.
it: La fine non è un numero.
ja: 終了が数値ではありません
ko: 끝이 숫자가 아닙니다.
pl: Koniec nie jest liczbą.
pt: O fim não é um número.
ro: Sfârșitul nu este un număr.
th: จุดสิ้นสุดไม่ใช่ตัวเลข
tr: Son bir sayı değil.
uk: Кінець не є числом.
vi: Điểm cuối không phải là số.
zh_hans: 结束位置不是数字。
zh_hant: 結尾不是數字。

# SelectionFile_Error_EmptyRange
source: The range is empty (the end is before the start, or the length is 0).
ar: النطاق فارغ (النهاية قبل البداية، أو الطول 0).
cs: Rozsah je prázdný (konec je před začátkem nebo je délka 0).
de: Der Bereich ist leer (das Ende liegt vor dem Anfang oder die Länge ist 0).
el: Η περιοχή είναι κενή (το τέλος είναι πριν από την αρχή ή το μήκος είναι 0).
es: El rango está vacío (el final es anterior al inicio o la longitud es 0).
fa: محدوده خالی است (پایان پیش از آغاز است یا طول 0 است).
fr: La plage est vide (la fin précède le début, ou la longueur est 0).
hu: A tartomány üres (a vég a kezdet előtt van, vagy a hossz 0).
id: Rentang kosong (akhir sebelum awal, atau panjangnya 0).
it: L'intervallo è vuoto (la fine precede l'inizio oppure la lunghezza è 0).
ja: 範囲が空です (終了が開始より前、または長さが 0)
ko: 범위가 비어 있습니다(끝이 시작보다 앞에 있거나 길이가 0).
pl: Zakres jest pusty (koniec jest przed początkiem lub długość wynosi 0).
pt: O intervalo está vazio (o fim está antes do início ou o comprimento é 0).
ro: Intervalul este gol (sfârșitul este înaintea începutului sau lungimea este 0).
th: ช่วงว่างเปล่า (จุดสิ้นสุดอยู่ก่อนจุดเริ่มต้น หรือความยาวเป็น 0)
tr: Aralık boş (son başlangıçtan önce veya uzunluk 0).
uk: Діапазон порожній (кінець перед початком або довжина дорівнює 0).
vi: Phạm vi trống (điểm cuối ở trước điểm đầu, hoặc độ dài bằng 0).
zh_hans: 范围为空（结束位置在开始位置之前，或长度为 0）。
zh_hant: 範圍是空的（結尾在開頭之前，或長度為 0）。

# SelectionFile_Error_BadLine
source: The line can't be read. Use "start length" or "start-end".
ar: تتعذر قراءة السطر. استخدم «البداية الطول» أو «البداية-النهاية».
cs: Řádek nelze přečíst. Použijte formát „začátek délka“ nebo „začátek-konec“.
de: Die Zeile kann nicht gelesen werden. Verwenden Sie „Anfang Länge“ oder „Anfang-Ende“.
el: Δεν είναι δυνατή η ανάγνωση της γραμμής. Χρησιμοποιήστε «αρχή μήκος» ή «αρχή-τέλος».
es: No se puede leer la línea. Usa “inicio longitud” o “inicio-final”.
fa: خط قابل خواندن نیست. از «آغاز طول» یا «آغاز-پایان» استفاده کنید.
fr: Impossible de lire la ligne. Utilisez « début longueur » ou « début-fin ».
hu: A sor nem olvasható. Használja a „kezdet hossz” vagy a „kezdet-vég” formát.
id: Baris tidak dapat dibaca. Gunakan “awal panjang” atau “awal-akhir”.
it: Impossibile leggere la riga. Usa “inizio lunghezza” o “inizio-fine”.
ja: 行を読めません。「開始 長さ」または「開始-終了」で書いてください
ko: 줄을 읽을 수 없습니다. "시작 길이" 또는 "시작-끝" 형식을 사용하세요.
pl: Nie można odczytać wiersza. Użyj formatu „początek długość” lub „początek-koniec”.
pt: Não é possível ler a linha. Use “início comprimento” ou “início-fim”.
ro: Linia nu poate fi citită. Utilizați „start length” sau „start-end”.
th: อ่านบรรทัดไม่ได้ ใช้รูปแบบ “เริ่มต้น ความยาว” หรือ “เริ่มต้น-สิ้นสุด”
tr: Satır okunamıyor. "başlangıç uzunluk" veya "başlangıç-son" biçimini kullanın.
uk: Не вдається прочитати рядок. Використовуйте формат «початок довжина» або «початок-кінець».
vi: Không thể đọc dòng. Hãy dùng “đầu độ_dài” hoặc “đầu-cuối”.
zh_hans: 无法读取该行。请使用“开始 长度”或“开始-结束”格式。
zh_hant: 無法讀取此行。請使用「開頭 長度」或「開頭-結尾」。

# SelectionFile_Error_BadJson
source: The JSON can't be read.
ar: تتعذر قراءة JSON.
cs: JSON nelze přečíst.
de: Das JSON kann nicht gelesen werden.
el: Δεν είναι δυνατή η ανάγνωση του JSON.
es: No se puede leer el JSON.
fa: JSON قابل خواندن نیست.
fr: Impossible de lire le JSON.
hu: A JSON nem olvasható.
id: JSON tidak dapat dibaca.
it: Impossibile leggere il JSON.
ja: JSON を読めません
ko: JSON을 읽을 수 없습니다.
pl: Nie można odczytać danych JSON.
pt: Não é possível ler o JSON.
ro: JSON-ul nu poate fi citit.
th: อ่าน JSON ไม่ได้
tr: JSON okunamıyor.
uk: Не вдається прочитати JSON.
vi: Không thể đọc JSON.
zh_hans: 无法读取该 JSON。
zh_hant: 無法讀取 JSON。

# Panel_History_Title
source: History
ar: السجل
cs: Historie
de: Verlauf
el: Ιστορικό
es: Historial
fa: سابقه
fr: Historique
hu: Előzmények
id: Riwayat
it: Cronologia
ja: 履歴
ko: 기록
pl: Historia
pt: Histórico
ro: Istoric
th: ประวัติ
tr: Geçmiş
uk: Журнал
vi: Lịch sử
zh_hans: 历史记录
zh_hant: 記錄

# Panel_Clipboard_Title
source: Clipboard
ar: الحافظة
cs: Schránka
de: Zwischenablage
el: Πρόχειρο
es: Portapapeles
fa: کلیپ‌بورد
fr: Presse-papiers
hu: Vágólap
id: Papan Klip
it: Appunti
ja: クリップボード
ko: 클립보드
pl: Schowek
pt: Área de transferência
th: คลิปบอร์ด
tr: Pano
uk: Буфер обміну
vi: Bảng tạm
zh_hans: 剪贴板
zh_hant: 剪貼簿

# History_Undo
source: Undo
ar: تراجع
cs: Zpět
de: Rückgängig
el: Αναίρεση
es: Deshacer
fa: واگرد
fr: Annuler
hu: Visszavonás
id: Batalkan
it: Annulla
ja: 元に戻す
ko: 실행 취소
pl: Cofnij
pt: Desfazer
ro: Anulare
th: เลิกทำ
tr: Geri al
uk: Скасувати
vi: Hoàn tác
zh_hans: 撤消
zh_hant: 復原

# History_Redo
source: Redo
ar: إعادة
cs: Znovu
de: Wiederholen
el: Επανάληψη
es: Rehacer
fa: ازنو
fr: Rétablir
hu: Mégis
id: Ulangi
it: Ripeti
ja: やり直し
ko: 다시 실행
pl: Ponów
pt: Refazer
ro: Refacere
th: ทำซ้ำ
tr: Yinele
uk: Повторити
vi: Làm lại
zh_hans: 重做
zh_hant: 取消復原

# History_Compare
source: Compare two points
ar: مقارنة نقطتين
cs: Porovnat dva body
de: Zwei Zeitpunkte vergleichen
el: Σύγκριση δύο σημείων
es: Comparar dos puntos
fa: مقایسهٔ دو نقطه
fr: Comparer deux états
hu: Két állapot összehasonlítása
id: Bandingkan dua titik
it: Confronta due punti
ja: 2 つの時点を比較
ko: 두 시점 비교
pl: Porównaj dwa punkty
pt: Comparar dois pontos
ro: Comparare a două puncte
th: เปรียบเทียบสองจุด
tr: İki noktayı karşılaştır
uk: Порівняти дві точки
vi: So sánh hai thời điểm
zh_hans: 比较两个时间点
zh_hant: 比較兩個時間點

# History_GoToState.Text
source: Go to This Point
ar: الانتقال إلى هذه النقطة
cs: Přejít na tento bod
de: Zu diesem Zeitpunkt wechseln
el: Μετάβαση σε αυτό το σημείο
es: Ir a este punto
fa: رفتن به این نقطه
fr: Revenir à cet état
hu: Ugrás erre az állapotra
id: Navigasi ke Titik Ini
it: Vai a questo punto
ja: この時点に移る
ko: 이 시점으로 이동
pl: Przejdź do tego punktu
pt: Ir para este ponto
ro: Salt la acest punct
th: ไปที่จุดนี้
tr: Bu Noktaya Git
uk: Перейти до цієї точки
vi: Đi tới Thời điểm Này
zh_hans: 转到此时间点
zh_hant: 移至此時間點

# History_SelectRange.Text
source: Go to This Range
ar: الانتقال إلى هذا النطاق
cs: Přejít na tento rozsah
de: Zu diesem Bereich wechseln
el: Μετάβαση σε αυτή την περιοχή
es: Ir a este rango
fa: رفتن به این محدوده
fr: Atteindre cette plage
hu: Ugrás erre a tartományra
id: Navigasi ke Rentang Ini
it: Vai a questo intervallo
ja: この範囲へ移動
ko: 이 범위로 이동
pl: Przejdź do tego zakresu
pt: Ir para este intervalo
ro: Salt la acest interval
th: ไปที่ช่วงนี้
tr: Bu Aralığa Git
uk: Перейти до цього діапазону
vi: Đi tới Phạm vi Này
zh_hans: 转到此范围
zh_hant: 移至此範圍

# History_CompareMenu.Text
source: Compare Two Points
ar: مقارنة نقطتين
cs: Porovnat dva body
de: Zwei Zeitpunkte vergleichen
el: Σύγκριση δύο σημείων
es: Comparar dos puntos
fa: مقایسهٔ دو نقطه
fr: Comparer deux états
hu: Két állapot összehasonlítása
id: Bandingkan Dua Titik
it: Confronta due punti
ja: 2 つの時点を比較
ko: 두 시점 비교
pl: Porównaj dwa punkty
pt: Comparar dois pontos
ro: Comparare a două puncte
th: เปรียบเทียบสองจุด
tr: İki Noktayı Karşılaştır
uk: Порівняти дві точки
vi: So sánh Hai Thời điểm
zh_hans: 比较两个时间点
zh_hant: 比較兩個時間點

# History_SavedMark
source: Saved
ar: محفوظ
cs: Uloženo
de: Gespeichert
el: Αποθηκεύτηκε
es: Guardado
fa: ذخیره‌شده
fr: Enregistré
hu: Mentve
id: Disimpan
it: Salvato
ja: 保存
ko: 저장됨
pl: Zapisano
pt: Salvo
ro: Salvat
th: บันทึกแล้ว
tr: Kaydedildi
uk: Збережено
vi: Đã lưu
zh_hans: 已保存
zh_hant: 已儲存

# History_CurrentState
source: current state
ar: الحالة الحالية
cs: aktuální stav
de: aktueller Zustand
el: τρέχουσα κατάσταση
es: estado actual
fa: وضعیت فعلی
fr: état actuel
hu: aktuális állapot
id: keadaan saat ini
it: stato corrente
ja: 現在の状態
ko: 현재 상태
pl: bieżący stan
pt: estado atual
ro: starea curentă
th: สถานะปัจจุบัน
tr: geçerli durum
uk: поточний стан
vi: trạng thái hiện tại
zh_hans: 当前状态
zh_hant: 目前狀態

# History_RedoState
source: can be redone
ar: يمكن إعادته
cs: lze provést znovu
de: kann wiederholt werden
el: μπορεί να επαναληφθεί
es: se puede rehacer
fa: قابل ازنو
fr: peut être rétabli
hu: megismételhető
id: dapat diulangi
it: può essere ripetuto
ja: やり直し可能
ko: 다시 실행 가능
pl: można ponowić
pt: pode ser refeito
ro: poate fi refăcut
th: ทำซ้ำได้
tr: yinelenebilir
uk: можна повторити
vi: có thể làm lại
zh_hans: 可重做
zh_hant: 可取消復原

# History_Range
source: {0} ({1} bytes)
ar: {0} ({1} بايت)
cs: {0} (bajty: {1})
el: {0} ({1} byte)
fa: {0} ({1} بایت)
fr: {0} ({1} octets)
hu: {0} ({1} bájt)
id: {0} ({1} byte)
it: {0} ({1} byte)
ja: {0} ({1} バイト)
ko: {0}({1}바이트)
pl: {0} ({1} B)
ro: {0} ({1} octeți)
th: {0} ({1} ไบต์)
tr: {0} ({1} bayt)
uk: {0} ({1} байтів)
vi: {0} ({1} byte)
zh_hans: {0}（{1} 字节）
zh_hant: {0}（{1} 個位元組）

# History_PointName
source: History {0}
ar: السجل {0}
cs: Historie {0}
de: Verlauf {0}
el: Ιστορικό {0}
es: Historial {0}
fa: سابقه {0}
fr: Historique {0}
hu: {0}. előzmény
id: Riwayat {0}
it: Cronologia {0}
ja: 履歴 {0}
ko: 기록 {0}
pl: Historia {0}
pt: Histórico {0}
ro: Istoric {0}
th: ประวัติ {0}
tr: Geçmiş {0}
uk: Журнал {0}
vi: Lịch sử {0}
zh_hans: 历史记录 {0}
zh_hant: 記錄 {0}

# EditOp_Move
source: Move
ar: نقل
cs: Přesunutí
de: Verschieben
el: Μετακίνηση
es: Mover
fa: جابه‌جایی
fr: Déplacement
hu: Áthelyezés
id: Pindahkan
it: Spostamento
ja: 移動
ko: 이동
pl: Przeniesienie
pt: Mover
ro: Mutare
th: ย้าย
tr: Taşı
uk: Переміщення
vi: Di chuyển
zh_hans: 移动
zh_hant: 移動

# EditOp_Copy
source: Copy
ar: نسخ
cs: Kopírování
de: Kopieren
el: Αντιγραφή
es: Copiar
fa: رونوشت
fr: Copie
hu: Másolás
id: Salin
it: Copia
ja: コピー
ko: 복사
pl: Kopiowanie
pt: Copiar
ro: Copiere
th: คัดลอก
tr: Kopyala
uk: Копіювання
vi: Sao chép
zh_hans: 复制
zh_hant: 複製

# EditOp_Cut
source: Cut
ar: قص
cs: Vyjmutí
de: Ausschneiden
el: Αποκοπή
es: Cortar
fa: برش
fr: Couper
hu: Kivágás
id: Potong
it: Taglia
ja: 切り取り
ko: 잘라내기
pl: Wycięcie
pt: Recortar
ro: Decupare
th: ตัด
tr: Kes
uk: Вирізання
vi: Cắt
zh_hans: 剪切
zh_hant: 剪下

# EditOp_InsertRectangle
source: Insert into rectangle
ar: الإدراج في مستطيل
cs: Vložení do obdélníku
de: In Rechteck einfügen
el: Εισαγωγή σε ορθογώνιο
es: Insertar en el rectángulo
fa: درج در مستطیل
fr: Insertion dans le rectangle
hu: Beszúrás téglalapba
id: Sisipkan ke persegi panjang
it: Inserimento nel rettangolo
ja: 矩形挿入
ko: 사각형에 삽입
pl: Wstawienie do prostokąta
pt: Inserir no retângulo
ro: Inserare în dreptunghi
th: แทรกลงในสี่เหลี่ยม
tr: Dikdörtgene ekle
uk: Вставлення в прямокутник
vi: Chèn vào hình chữ nhật
zh_hans: 插入到矩形
zh_hant: 插入到矩形

# EditOp_FillZero
source: Fill with 00
ar: تعبئة بـ 00
cs: Vyplnění hodnotou 00
de: Mit 00 füllen
el: Συμπλήρωση με 00
es: Rellenar con 00
fa: پر کردن با 00
fr: Remplir avec 00
hu: Kitöltés 00-val
id: Isi dengan 00
it: Riempi con 00
ja: 00 で塗りつぶし
ko: 00으로 채우기
pl: Wypełnienie 00
pt: Preencher com 00
ro: Umplere cu 00
th: เติมด้วย 00
tr: 00 ile doldur
uk: Заповнення 00
vi: Điền 00
zh_hans: 用 00 填充
zh_hant: 以 00 填滿

# ClipboardPanel_Slot
source: User clipboard {0}
ar: حافظة المستخدم {0}
cs: Uživatelská schránka {0}
de: Benutzer-Zwischenablage {0}
el: Πρόχειρο χρήστη {0}
es: Portapapeles de usuario {0}
fa: کلیپ‌بورد کاربر {0}
fr: Presse-papiers utilisateur {0}
hu: {0}. felhasználói vágólap
id: Papan klip pengguna {0}
it: Appunti utente {0}
ja: ユーザークリップボード {0}
ko: 사용자 클립보드 {0}
pl: Schowek użytkownika {0}
pt: Área de transferência do usuário {0}
ro: Clipboard utilizator {0}
th: คลิปบอร์ดผู้ใช้ {0}
tr: Kullanıcı panosu {0}
uk: Користувацький буфер {0}
vi: Bảng tạm người dùng {0}
zh_hans: 用户剪贴板 {0}
zh_hant: 使用者剪貼簿 {0}

# ClipboardPanel_Empty
source: (empty)
ar: (فارغة)
cs: (prázdné)
de: (leer)
el: (κενό)
es: (vacío)
fa: (خالی)
fr: (vide)
hu: (üres)
id: (kosong)
it: (vuoto)
ja: (空)
ko: (비어 있음)
pl: (pusty)
pt: (vazio)
ro: (gol)
th: (ว่าง)
tr: (boş)
uk: (порожньо)
vi: (trống)
zh_hans: （空）
zh_hant: （空的）
